# Line Chat Bot Record Expenses
##### Mr.Jakkrit Sonsanit

***

### Import Library

In [18]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from firebase import firebase

### Create New DataFrame

In [19]:
# dfe = pd.DataFrame({
#     'date':[],
#     'text':[],
#     'money':[],
#     'cate':[]
# })

## EXPENSES
***

### Load Dataframe

In [20]:
dfe = pd.read_csv('Expenses.csv')
dfe.tail()

          date        text  money  cate
83  2019-10-16    ข้าวเย็น   40.0  Food
84  2019-10-17  ข้าวเที่ยง   35.0  Food
85  2019-10-17         น้ำ   15.0  Food
86  2019-10-17    ข้าวเย็น   45.0  Food
87  2019-10-17      มะละกอ   20.0  Food

### Connect Firebase

In [21]:
authentication = firebase.FirebaseAuthentication('wI4pPnsc1m2Ei7E3Q3drORPWtDBo927IxwBsA6ZH', 'palm8ikaa2@gmail.com', extra={'id': 123})
firebase = firebase.FirebaseApplication('https://line-bot-chrins.firebaseio.com/', authentication=authentication)

### Query Expenses from firebase

In [22]:
result = firebase.get('/expenses', None)

### Append new expenses in dataframe

In [23]:
tmp = list()
old_numlist = len(dfe)
for k, v in result.items():
    tmp.append(v)
for i in range(len(tmp)):
    if i >= old_numlist:
        dfe = dfe.append(tmp[i], ignore_index=True)
dfe.date = pd.to_datetime(dfe.date)
dfe.tail()

         date        text  money  cate
87 2019-10-17      มะละกอ   20.0  Food
88 2019-10-18  ข้าวเที่ยง   35.0   NaN
89 2019-10-18    ข้าวเย็น   40.0   NaN
90 2019-10-18    ค่าเหล้า  260.0   NaN
91 2019-10-18     ลูกชิ้น   20.0   NaN

### Append expenses on day in dataframe

In [202]:
# for k, v in result.items():
#     if v['date'] == '6/9/2019':
#         dfe = dfe.append(v, ignore_index=True)
# dfe.date = pd.to_datetime(dfe.date)
# dfe.head()

### Append all expenses to dataframe

In [203]:
# for k, v in result.items():
#     dfe = dfe.append(v, ignore_index=True)
# dfe.date = pd.to_datetime(dfe.date)
# dfe.head()

### Set NaN Category is Food

In [27]:
dfe.cate = dfe.cate.fillna('Food')
dfe.tail(10)

         date        text  money           cate
82 2019-10-16     ลูกชิ้น   20.0           Food
83 2019-10-16    ข้าวเย็น   40.0           Food
84 2019-10-17  ข้าวเที่ยง   35.0           Food
85 2019-10-17         น้ำ   15.0           Food
86 2019-10-17    ข้าวเย็น   45.0           Food
87 2019-10-17      มะละกอ   20.0           Food
88 2019-10-18  ข้าวเที่ยง   35.0           Food
89 2019-10-18    ข้าวเย็น   40.0           Food
90 2019-10-18    ค่าเหล้า  260.0  Entertainment
91 2019-10-18     ลูกชิ้น   20.0           Food

### Change category

In [25]:
t = ['Entertainment', 'Transportation', 'Shopping', 'Food', 'Bill', 'Other']
dfe.at[90, 'cate'] = t[0]
dfe.iloc[90:91]

         date      text  money           cate
90 2019-10-18  ค่าเหล้า  260.0  Entertainment

### Save to csv

In [26]:
dfe.to_csv('Expenses.csv', index=False)

## INCOME
***

### Create DataFrame

In [28]:
# dfi = pd.DataFrame({
#     'date':[],
#     'text':[],
#     'money':[],
# })

### Load DataFrame

In [29]:
dfi = pd.read_csv('income.csv')

### Query income from firebase

In [30]:
result = firebase.get('/income', None)

### Append new income

In [31]:
tmp = list()
old_numlist = len(dfi)
for k, v in result.items():
    tmp.append(v)
for i in range(len(tmp)):
    if i >= old_numlist:
        dfi = dfi.append(tmp[i], ignore_index=True)
dfi.date = pd.to_datetime(dfi.date)
dfi.tail()

        date     text    money
0 2019-10-01   พ่อให้  14000.0
1 2019-10-17  ได้เงิน    625.0
2 2019-10-18  ได้เงิน    155.0

### Save to csv

In [32]:
dfi.to_csv('income.csv', index=False)

## Summary 
***

### Balance

In [33]:
print("Balance : %.2f Bath" %(sum(dfi.money)-sum(dfe.money)))

Balance : 3029.23 Bath

### Total Incom and Expenses

In [37]:
print("Total Income :", sum(dfi.money), 'Bath')
print("Total Expenses :", sum(dfe.money), 'Baht')

Total Income : 14780.0 Bath
Total Expenses : 11750.77 Baht

### Total Expenses in day

In [38]:
d = "2019-"+input("mm-dd :")
print("Total Expenses in", d, ":", sum(dfe[dfe.date == d]['money']), 'Baht')

mm-dd :10-18
Total Expenses in 2019-10-18 : 355.0 Baht

### Total Expenses in each month

In [18]:
tmp = dfe.rename(columns={"date": "Month", "money":"Money"})
tmp.groupby(tmp.Month.dt.month).sum()

          Money
Month
10     11240.77

### Total Expenses in each category

In [35]:
dfe.groupby(['cate']).sum()

                  money
cate
Bill            6387.77
Entertainment   1250.00
Food            2579.00
Other            150.00
Saving            20.00
Shopping        1104.00
Transportation   260.00

### Expenses in each category

In [36]:
ls = ['1.Food', '2.Entertainment', '3.Bill', '4.Saving', '5.Shopping', '6.Transportation', '7.Other']
print(*ls)
dfe[dfe.cate == ls[int(input('Enter number of category '))-1][2:]]

1.Food 2.Entertainment 3.Bill 4.Saving 5.Shopping 6.Transportation 7.Other
Enter number of category 2

         date      text  money           cate
54 2019-10-09   ค่าหนัง  140.0  Entertainment
55 2019-10-10   เติมเกม  300.0  Entertainment
56 2019-10-10    ดูหนัง  100.0  Entertainment
59 2019-10-11  ค่าเหล้า  120.0  Entertainment
81 2019-10-16  ค่าเหล้า  330.0  Entertainment
90 2019-10-18  ค่าเหล้า  260.0  Entertainment